arduino12/n76e003_platformio/lib/N76E003/Function_Define.h
// GPIO all quasi mode 
#define Set_All_GPIO_Quasi_Mode				do{P0M1=0;P0M2=0;P1M1=0;P1M2=0;P3M1=0;P3M2=0;}while(0)

// Enable INT GPIO port 0~3
#define Enable_INT_Port0					do{clr_PIPS1;clr_PIPS0;}while(0)
#define Enable_INT_Port1					do{clr_PIPS1;set_PIPS0;}while(0)
#define Enable_INT_Port2					do{set_PIPS1;clr_PIPS0;}while(0)
#define Enable_INT_Port3					do{set_PIPS1;set_PIPS0;}while(0)

// Enable each bit low level trig mode
#define Enable_BIT7_LowLevel_Trig			do{PICON&=0x7F;PINEN|=0x80;PIPEN&=0x7F;}while(0)
#define Enable_BIT6_LowLevel_Trig			do{PICON&=0x7F;PINEN|=0x40;PIPEN&=0xBF;}while(0)
#define Enable_BIT5_LowLevel_Trig			do{PICON&=0xBF;PINEN|=0x20;PIPEN&=0xDF;}while(0)
#define Enable_BIT4_LowLevel_Trig			do{PICON&=0xBF;PINEN|=0x10;PIPEN&=0xEF;}while(0)
#define Enable_BIT3_LowLevel_Trig			do{PICON&=0xDF;PINEN|=0x08;PIPEN&=0xF7;}while(0)
#define Enable_BIT2_LowLevel_Trig			do{PICON&=0xEF;PINEN|=0x04;PIPEN&=0xFB;}while(0)
#define Enable_BIT1_LowLevel_Trig			do{PICON&=0xF7;PINEN|=0x02;PIPEN&=0xFD;}while(0)
#define Enable_BIT0_LowLevel_Trig			do{PICON&=0xFD;PINEN|=0x01;PIPEN&=0xFE;}while(0)

// Enable each bit high level trig mode
#define Enable_BIT7_HighLevel_Trig			do{PICON&=0x7F;PINEN&=0x7F;PIPEN|=0x80;}while(0)
#define Enable_BIT6_HighLevel_Trig			do{PICON&=0x7F;PINEN&=0xBF;PIPEN|=0x40;}while(0)
#define Enable_BIT5_HighLevel_Trig			do{PICON&=0xBF;PINEN&=0xDF;PIPEN|=0x20;}while(0)
#define Enable_BIT4_HighLevel_Trig			do{PICON&=0xBF;PINEN&=0xEF;PIPEN|=0x10;}while(0)
#define Enable_BIT3_HighLevel_Trig			do{PICON&=0xDF;PINEN&=0xF7;PIPEN|=0x08;}while(0)
#define Enable_BIT2_HighLevel_Trig			do{PICON&=0xEF;PINEN&=0xFB;PIPEN|=0x04;}while(0)
#define Enable_BIT1_HighLevel_Trig			do{PICON&=0xF7;PINEN&=0xFD;PIPEN|=0x02;}while(0)
#define Enable_BIT0_HighLevel_Trig			do{PICON&=0xFD;PINEN&=0xFE;PIPEN|=0x01;}while(0)

// Enable each bit falling edge trig mode
#define Enable_BIT7_FallEdge_Trig			do{PICON|=0x80;PINEN|=0x80;PIPEN&=0x7F;}while(0)
#define Enable_BIT6_FallEdge_Trig			do{PICON|=0x80;PINEN|=0x40;PIPEN&=0xBF;}while(0)
#define Enable_BIT5_FallEdge_Trig			do{PICON|=0x40;PINEN|=0x20;PIPEN&=0xDF;}while(0)
#define Enable_BIT4_FallEdge_Trig			do{PICON|=0x40;PINEN|=0x10;PIPEN&=0xEF;}while(0)
#define Enable_BIT3_FallEdge_Trig			do{PICON|=0x20;PINEN|=0x08;PIPEN&=0xF7;}while(0)
#define Enable_BIT2_FallEdge_Trig			do{PICON|=0x10;PINEN|=0x04;PIPEN&=0xFB;}while(0)
#define Enable_BIT1_FallEdge_Trig			do{PICON|=0x08;PINEN|=0x02;PIPEN&=0xFD;}while(0)
#define Enable_BIT0_FallEdge_Trig			do{PICON|=0x04;PINEN|=0x01;PIPEN&=0xFE;}while(0)

// Enable each bit rasing edge trig mode
#define Enable_BIT7_RasingEdge_Trig			do{PICON|=0x80;PINEN&=0x7F;PIPEN|=0x80;}while(0)
#define Enable_BIT6_RasingEdge_Trig			do{PICON|=0x80;PINEN&=0xBF;PIPEN|=0x40;}while(0)
#define Enable_BIT5_RasingEdge_Trig			do{PICON|=0x40;PINEN&=0xDF;PIPEN|=0x20;}while(0)
#define Enable_BIT4_RasingEdge_Trig			do{PICON|=0x40;PINEN&=0xEF;PIPEN|=0x10;}while(0)
#define Enable_BIT3_RasingEdge_Trig			do{PICON|=0x20;PINEN&=0xF7;PIPEN|=0x08;}while(0)
#define Enable_BIT2_RasingEdge_Trig			do{PICON|=0x10;PINEN&=0xFB;PIPEN|=0x04;}while(0)
#define Enable_BIT1_RasingEdge_Trig			do{PICON|=0x08;PINEN&=0xFD;PIPEN|=0x02;}while(0)
#define Enable_BIT0_RasingEdge_Trig			do{PICON|=0x04;PINEN&=0xFE;PIPEN|=0x01;}while(0)

// TIMER_DIVs
#if defined(FOSC_110592)									// Fsys = 11.0592MHz 
	#define TIMER_DIV12_VALUE_10us			65536-9			//9*12/11.0592 = 10 us			Timer divider = 12 for TM0/TM1
	#define TIMER_DIV12_VALUE_1ms			65536-923		//923*12/11.0592 = 1 ms			Timer divider = 12
	#define	TIMER_DIV12_VALUE_10ms			65536-9216		//18432*12/22118400 = 10 ms		Timer divider = 12
	#define TIMER_DIV4_VALUE_10us			65536-28		//28*4/11.0592 = 10 us			Timer divider = 4	for TM2/TM3
	#define TIMER_DIV4_VALUE_1ms			65536-2765		//2765*4/11.0592 = 1 ms			Timer divider = 4
	#define TIMER_DIV4_VALUE_100us			65536-277		//553*4/22118400 = 100 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_200us			65536-553		//1106*4/22118400 = 200 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_500us			65536-1383		//2765*4/22118400 = 500 us		Timer divider = 4		
	#define TIMER_DIV16_VALUE_10ms			65536-6912		//1500*16/22118400 = 10 ms		Timer divider = 16
	#define TIMER_DIV64_VALUE_30ms			65536-5184		//10368*64/22118400 = 30 ms		Timer divider = 64
	#define	TIMER_DIV128_VALUE_100ms		65536-8640		//17280*128/22118400 = 100 ms	Timer divider = 128
	#define	TIMER_DIV128_VALUE_200ms		65536-17280		//34560*128/22118400 = 200 ms	Timer divider = 128
	#define TIMER_DIV256_VALUE_500ms		65536-21600		//43200*256/22118400 = 500 ms	Timer divider = 256
	#define TIMER_DIV512_VALUE_1s			65536-21600		//43200*512/22118400 = 1 s		Timer divider = 512
#elif defined(FOSC_160000)									// Fsys = 16MHz 
	#define TIMER_DIV12_VALUE_10us			65536-13		//13*12/16000000 = 10 us		Timer divider = 12 for TM0/TM1
	#define TIMER_DIV12_VALUE_100us			65536-130		//130*12/16000000 = 10 us		Timer divider = 12 
	#define TIMER_DIV12_VALUE_1ms			65536-1334		//1334*12/16000000 = 1 ms		Timer divider = 12 
	#define TIMER_DIV12_VALUE_10ms			65536-13334		//13334*12/16000000 = 10 ms		Timer divider = 12 
	#define TIMER_DIV12_VALUE_40ms			65536-53336		//53336*12/16000000 = 40 ms		Timer divider = 12 
	#define TIMER_DIV4_VALUE_10us			65536-40		//40*4/16000000 = 10 us			Timer divider = 4	for TM2/TM3
	#define TIMER_DIV4_VALUE_100us			65536-400		//400*4/16000000 = 100 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_200us			65536-800		//800*4/16000000 = 200 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_500us			65536-2000		//2000*4/16000000 = 500 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_1ms			65536-4000		//4000*4/16000000 = 1 ms		Timer divider = 4
	#define TIMER_DIV16_VALUE_10ms			65536-10000		//10000*16/16000000 = 10 ms		Timer divider = 16
	#define TIMER_DIV64_VALUE_30ms			65536-7500		//7500*64/16000000 = 30 ms		Timer divider = 64
	#define	TIMER_DIV128_VALUE_100ms		65536-12500		//12500*128/16000000 = 100 ms	Timer divider = 128
	#define	TIMER_DIV128_VALUE_200ms		65536-25000		//25000*128/16000000 = 200 ms	Timer divider = 128
	#define TIMER_DIV256_VALUE_500ms		65536-31250		//31250*256/16000000 = 500 ms 	Timer divider = 256
	#define	TIMER_DIV512_VALUE_1s			65536-31250		//31250*512/16000000 = 1 s		Timer Divider = 512
#elif defined(FOSC_184320)									// Fsys = 18.432MHz 
	#define TIMER_DIV12_VALUE_10us			65536-15		//15*12/18.432 = 10 us			Timer Clock = Fsys/12
	#define TIMER_DIV12_VALUE_1ms			65536-1536		//1536*12/18.432 = 1 ms			Timer Clock = Fsys/12
	#define TIMER_DIV4_VALUE_10us			65536-46		//46*4/18.432 = 10 us			Timer Clock = Fsys/4
	#define TIMER_DIV4_VALUE_1ms			65536-4608		//4608*4/18.432 = 1 ms			Timer Clock = Fsys/4
#elif defined(FOSC_200000)									// Fsys = 20 MHz
	#define TIMER_DIV12_VALUE_10us			65536-17		//17*12/20000000 = 10 us		Timer Clock = Fsys/12
	#define TIMER_DIV12_VALUE_1ms			65536-1667		//1667*12/20000000 = 1 ms		Timer Clock = Fsys/12
	#define TIMER_DIV4_VALUE_10us			65536-50		//50*4/20000000 = 10 us			Timer Clock = Fsys/4
	#define TIMER_DIV4_VALUE_1ms			65536-5000		//5000*4/20000000 = 1 ms		Timer Clock = Fsys/4
#elif defined(FOSC_221184)									// Fsys = 22.1184 MHz 
	#define TIMER_DIV12_VALUE_10us			65536-18		//18*12/22118400 = 10 us		Timer divider = 12
	#define TIMER_DIV12_VALUE_1ms			65536-1843		//1843*12/22118400 = 1 ms		Timer divider = 12
	#define	TIMER_DIV12_VALUE_10ms			65536-18432		//18432*12/22118400 = 10 ms		Timer divider = 12
	#define TIMER_DIV4_VALUE_10us			65536-56		//9*4/22118400 = 10 us			Timer divider = 4
	#define TIMER_DIV4_VALUE_1ms			65536-5530		//923*4/22118400 = 1 ms			Timer divider = 4
	#define TIMER_DIV4_VALUE_100us			65536-553		//553*4/22118400 = 100 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_200us			65536-1106		//1106*4/22118400 = 200 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_500us			65536-2765		//2765*4/22118400 = 500 us		Timer divider = 4		
	#define TIMER_DIV16_VALUE_10ms			65536-13824		//1500*16/22118400 = 10 ms		Timer divider = 16
	#define TIMER_DIV64_VALUE_30ms			65536-10368		//10368*64/22118400 = 30 ms		Timer divider = 64
	#define	TIMER_DIV128_VALUE_100ms		65536-17280		//17280*128/22118400 = 100 ms	Timer divider = 128
	#define	TIMER_DIV128_VALUE_200ms		65536-34560		//34560*128/22118400 = 200 ms	Timer divider = 128
	#define TIMER_DIV256_VALUE_500ms		65536-43200		//43200*256/22118400 = 500 ms	Timer divider = 256
	#define TIMER_DIV512_VALUE_1s			65536-43200		//43200*512/22118400 = 1 s		Timer divider = 512
#elif defined(FOSC_240000)									// if Fsys = 20 MHz
	#define TIMER_DIV12_VALUE_10us			65536-20		//20*12/24000000 = 10 us		Timer divider = 12
	#define TIMER_DIV12_VALUE_1ms			65536-2000		//2000*12/24000000 = 1 ms		Timer divider = 12
	#define TIMER_DIV12_VALUE_10ms			65536-20000		//2000*12/24000000 = 10 ms		Timer divider = 12
	#define TIMER_DIV4_VALUE_10us			65536-60		//60*4/24000000 = 10 us			Timer divider = 4
	#define TIMER_DIV4_VALUE_100us			65536-600		//600*4/24000000 = 100 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_200us			65536-1200		//1200*4/24000000 = 200 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_500us			65536-3000		//3000*4/24000000 = 500 us		Timer divider = 4
	#define TIMER_DIV4_VALUE_1ms			65536-6000		//6000*4/24000000 = 1 ms		Timer divider = 4
	#define TIMER_DIV16_VALUE_10ms			65536-15000		//15000*16/24000000 = 10 ms		Timer divider = 16
	#define TIMER_DIV64_VALUE_30ms			65536-11250		//11250*64/24000000 = 30 ms		Timer divider = 64
	#define	TIMER_DIV128_VALUE_100ms		65536-18750		//37500*128/24000000 = 200 ms	Timer divider = 128
	#define	TIMER_DIV128_VALUE_200ms		65536-37500		//37500*128/24000000 = 200 ms	Timer divider = 128
	#define TIMER_DIV256_VALUE_500ms		65536-46875		//46875*256/24000000 = 500 ms	Timer divider = 256
	#define	TIMER_DIV512_VALUE_1s			65536-46875		//46875*512/24000000 = 1 s		Timer Divider = 512
#endif

// Timer0
#define TIMER0_MODE0_ENABLE					TMOD&=0xF0
#define TIMER0_MODE1_ENABLE					do{TMOD&=0xF0;TMOD|=0x01;}while(0)
#define TIMER0_MODE2_ENABLE					do{TMOD&=0xF0;TMOD|=0x02;}while(0)
#define TIMER0_MODE3_ENABLE					do{TMOD&=0xF0;TMOD|=0x03;}while(0)

