arduino12/n76e003_platformio/lib/N76E003/Function_Define.h
// Timer1
#define TIMER1_MODE0_ENABLE					TMOD&=0x0F
#define TIMER1_MODE1_ENABLE					do{TMOD&=0x0F;TMOD|=0x10;}while(0)
#define TIMER1_MODE2_ENABLE					do{TMOD&=0x0F;TMOD|=0x20;}while(0)
#define TIMER1_MODE3_ENABLE					do{TMOD&=0x0F;TMOD|=0x30;}while(0)

// Timer2
#define TIMER2_DIV_4						do{T2MOD|=0x10;T2MOD&=0x9F;}while(0)
#define TIMER2_DIV_16						do{T2MOD|=0x20;T2MOD&=0xAF;}while(0)
#define TIMER2_DIV_32						do{T2MOD|=0x30;T2MOD&=0xBF;}while(0)
#define TIMER2_DIV_64						do{T2MOD|=0x40;T2MOD&=0xCF;}while(0)
#define TIMER2_DIV_128						do{T2MOD|=0x50;T2MOD&=0xDF;}while(0)
#define TIMER2_DIV_256						do{T2MOD|=0x60;T2MOD&=0xEF;}while(0)
#define TIMER2_DIV_512						T2MOD|=0x70
#define TIMER2_Auto_Reload_Delay_Mode		do{T2CON&=~SET_BIT0;T2MOD|=SET_BIT7;T2MOD|=SET_BIT3;}while(0)
#define TIMER2_Compare_Capture_Mode			do{T2CON|=SET_BIT0;T2MOD&=~SET_BIT7;T2MOD|=SET_BIT2;}while(0)
#define TIMER2_CAP0_Capture_Mode			do{T2CON&=~SET_BIT0;T2MOD=0x89;}while(0)
#define TIMER2_CAP1_Capture_Mode			do{T2CON&=~SET_BIT0;T2MOD=0x8A;}while(0)
#define TIMER2_CAP2_Capture_Mode			do{T2CON&=~SET_BIT0;T2MOD=0x8B;}while(0)

// Timer2 Capture
//   Falling Edge
#define IC0_P12_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC1_P11_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x01;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC2_P10_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x02;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC3_P00_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x03;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC3_P04_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x04;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC4_P01_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x05;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC5_P03_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x06;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC6_P05_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x07;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC7_P15_CAP0_FallingEdge_Capture	do{CAPCON1&=0xFC;CAPCON3&=0xF0;CAPCON3|=0x08;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)

#define IC0_P12_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC1_P11_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x10;CAPCON0|=SET_BIT5;CAPCON0|=SET_BIT5;}while(0)
#define	IC2_P10_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x20;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC3_P00_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x30;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC3_P04_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x40;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC4_P01_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x50;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC5_P03_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x60;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC6_P05_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x70;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC7_P15_CAP1_FallingEdge_Capture	do{CAPCON1&=0xF3;CAPCON3&=0x0F;CAPCON3|=0x80;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)

#define IC0_P12_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC1_P11_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x10;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC2_P10_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x20;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC3_P00_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x30;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC3_P04_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x40;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC4_P01_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x50;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC5_P03_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x60;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC6_P05_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x70;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC7_P15_CAP2_FallingEdge_Capture	do{CAPCON1&=0x0F;CAPCON4&=0xF0;CAPCON4|=0x80;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)

//   Rising edge
#define IC0_P12_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC1_P11_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x01;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC2_P10_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x02;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC3_P00_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x03;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC3_P04_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x04;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC4_P01_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x05;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC5_P03_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x06;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC6_P05_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x07;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC7_P15_CAP0_RisingEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x01;CAPCON3&=0xF0;CAPCON3|=0x08;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)

#define IC0_P12_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC1_P11_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x10;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC2_P10_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x20;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC3_P00_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x30;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC3_P04_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x40;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC4_P01_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x50;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC5_P03_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x60;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC6_P05_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x70;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC7_P15_CAP1_RisingEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x04;CAPCON3&=0x0F;CAPCON3|=0x80;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)

#define IC0_P12_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC1_P11_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x01;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC2_P10_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x02;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC3_P00_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x03;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC3_P04_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x04;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC4_P01_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x05;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC5_P03_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x06;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC6_P05_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x07;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC7_P15_CAP3_RisingEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x10;CAPCON4&=0xF0;CAPCON4|=0x08;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)

//   Both edge
#define IC0_P12_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC1_P11_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x01;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC2_P10_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x02;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC3_P00_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x03;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC3_P04_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x04;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC4_P01_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x05;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC5_P03_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x06;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC6_P05_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x07;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)
#define	IC7_P15_CAP0_BothEdge_Capture		do{CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x08;CAPCON0|=SET_BIT4;CAPCON2|=SET_BIT4;}while(0)

#define IC0_P12_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC1_P11_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x10;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC2_P10_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x20;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC3_P00_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x30;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC3_P04_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x40;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC4_P01_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x50;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC5_P03_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x60;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC6_P05_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x70;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)
#define	IC7_P15_CAP1_BothEdge_Capture		do{CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x80;CAPCON0|=SET_BIT5;CAPCON2|=SET_BIT5;}while(0)

#define IC0_P12_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC1_P11_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x01;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC2_P10_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x02;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC3_P00_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x03;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC3_P04_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x04;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC4_P01_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x05;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC5_P03_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x06;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC6_P05_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x07;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)
#define	IC7_P15_CAP3_BothEdge_Capture		do{CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x08;CAPCON0|=SET_BIT6;CAPCON2|=SET_BIT6;}while(0)

#define TIMER2_IC2_DISABLE					CAPCON0&=~SET_BIT6			 
#define TIMER2_IC1_DISABLE					CAPCON0&=~SET_BIT5			
#define TIMER2_IC0_DISABLE					CAPCON0&=~SET_BIT4	

// PMW clock source select
#define PWM_CLOCK_FSYS						CKCON&=0xBF
#define PWM_CLOCK_TIMER1					CKCON|=0x40

