arduino12/n76e003_platformio/lib/N76E003/Function_Define.h
// PWM clock devide
#define PWM_CLOCK_DIV_2						do{PWMCON1|=0x01;PWMCON1&=0xF9;}while(0)
#define PWM_CLOCK_DIV_4						do{PWMCON1|=0x02;PWMCON1&=0xFA;}while(0)
#define PWM_CLOCK_DIV_8						do{PWMCON1|=0x03;PWMCON1&=0xFB;}while(0)
#define PWM_CLOCK_DIV_16					do{PWMCON1|=0x04;PWMCON1&=0xFC;}while(0)
#define PWM_CLOCK_DIV_32					do{PWMCON1|=0x05;PWMCON1&=0xFD;}while(0)
#define PWM_CLOCK_DIV_64					do{PWMCON1|=0x06;PWMCON1&=0xFE;}while(0)
#define PWM_CLOCK_DIV_128					PWMCON1|=0x07

// PWM I/O select
#define PWM5_P15_OUTPUT_ENABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1|=0x20;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P1.5 as PWM5 output enable
#define PWM5_P03_OUTPUT_ENABLE				PIOCON0|=0x20																										//P0.3 as PWM5
#define PWM4_P01_OUTPUT_ENABLE				PIOCON0|=0x10																										//P0.1 as PWM4 output enable
#define PWM3_P04_OUTPUT_ENABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1|=0x08;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P0.4 as PWM3 output enable
#define PWM3_P00_OUTPUT_ENABLE				PIOCON0|=0x08																										//P0.0 as PWM3 
#define PWM2_P05_OUTPUT_ENABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1|=0x04;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P1.0 as PWM2 output enable
#define PWM2_P10_OUTPUT_ENABLE				PIOCON0|=0x04																										//P1.0 as PWM2
#define PWM1_P14_OUTPUT_ENABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1|=0x02;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P1.4 as PWM1 output enable
#define PWM1_P11_OUTPUT_ENABLE				PIOCON0|=0x02																										//P1.1 as PWM1 
#define PWM0_P12_OUTPUT_ENABLE				PIOCON0|=0x01																										//P1.2 as PWM0 output enable
#define ALL_PWM_OUTPUT_ENABLE				do{PIOCON0=0xFF;PIOCON1=0xFF;}while(0)
#define PWM5_P15_OUTPUT_DISABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1&=0xDF;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P1.5 as PWM5 output disable
#define PWM5_P03_OUTPUT_DISABLE				PIOCON0&=0xDF																										//P0.3 as PWM5
#define PWM4_P01_OUTPUT_DISABLE				PIOCON0&=0xEF																										//P0.1 as PWM4 output disable
#define PWM3_P04_OUTPUT_DISABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1&=0xF7;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P0.4 as PWM3 output disable
#define PWM3_P00_OUTPUT_DISABLE				PIOCON0&=0xF7																										//P0.0 as PWM3 
#define PWM2_P05_OUTPUT_DISABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1&=0xFB;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P1.0 as PWM2 output disable
#define PWM2_P10_OUTPUT_DISABLE				PIOCON0&=0xFB																										//P1.0 as PWM2
#define PWM1_P14_OUTPUT_DISABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;SFRS|=0x01;PIOCON1&=0xFD;TA=0xAA;TA=0x55;SFRS&=0xFE;EA=BIT_TMP;}while(0)				//P1.4 as PWM1 output disable
#define PWM1_P11_OUTPUT_DISABLE				PIOCON0&=0xFD																										//P1.1 as PWM1 
#define PWM0_P12_OUTPUT_DISABLE				PIOCON0&=0xFE																										//P1.2 as PWM0 output disable
#define ALL_PWM_OUTPUT_DISABLE				do{PIOCON0=0x00;PIOCON1=0x00;}while(0)

// PWM I/O Polarity Control
#define PWM5_OUTPUT_INVERSE					PNP|=0x20				
#define PWM4_OUTPUT_INVERSE					PNP|=0x10				
#define PWM3_OUTPUT_INVERSE					PNP|=0x08				
#define PWM2_OUTPUT_INVERSE					PNP|=0x04				
#define PWM1_OUTPUT_INVERSE					PNP|=0x02				
#define PWM0_OUTPUT_INVERSE					PNP|=0x01				
#define PWM_OUTPUT_ALL_INVERSE				PNP=0xFF
#define PWM5_OUTPUT_NORMAL					PNP&=0xDF				
#define PWM4_OUTPUT_NORMAL					PNP&=0xEF				
#define PWM3_OUTPUT_NORMAL					PNP&=0xF7				
#define PWM2_OUTPUT_NORMAL					PNP&=0xFB				
#define PWM1_OUTPUT_NORMAL					PNP&=0xFD				
#define PWM0_OUTPUT_NORMAL					PNP&=0xFE				
#define PWM_OUTPUT_ALL_NORMAL				PNP=0x00

// PWM type
#define PWM_EDGE_TYPE						PWMCON1&=~SET_BIT4
#define PWM_CENTER_TYPE						PWMCON1|=SET_BIT4

// PWM mode
#define PWM_IMDEPENDENT_MODE				PWMCON1&=0x3F
#define PWM_COMPLEMENTARY_MODE				do{PWMCON1|=0x40;PWMCON1&=0x7F;}while(0)
#define PWM_SYNCHRONIZED_MODE				do{PWMCON1|=0x80;PWMCON1&=0xBF;}while(0)
#define PWM_GP_MODE_ENABLE					PWMCON1|=0x20
#define PWM_GP_MODE_DISABLE					PWMCON1&=0xDF

// PMW interrupt setting
#define PWM_FALLING_INT						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC&=0xCF;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_RISING_INT						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC|=0x10;PWMCON0&=0xDF;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_CENTRAL_POINT_INT				do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC|=0x20;PWMCON0&=0xEF;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_PERIOD_END_INT					do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC|=0x30;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)

// PWM interrupt pin select
#define PWM_INT_PWM0						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC&=0xF8;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_INT_PWM1						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC&=0xF8;PWMINTC|=0x01;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_INT_PWM2						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC&=0xF8;PWMINTC|=0x02;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_INT_PWM3						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC&=0xF8;PWMINTC|=0x03;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_INT_PWM4						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC&=0xF8;PWMINTC|=0x04;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)
#define PWM_INT_PWM5						do{BIT_TMP=EA;TA=0xAA;TA=0x55;SFRS=0x01;PWMINTC&=0xF8;PWMINTC|=0x05;TA=0xAA;TA=0x55;SFRS=0x00;EA=BIT_TMP;}while(0)

// PWM Dead time setting
#define PWM45_DEADTIME_ENABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x04;EA=BIT_TMP;}while(0)
#define PWM34_DEADTIME_ENABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x02;EA=BIT_TMP;}while(0)
#define PWM01_DEADTIME_ENABLE				do{BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x01;EA=BIT_TMP;}while(0)

// For ADC INIT setting 
#define Enable_ADC_AIN0						do{ADCCON0&=0xF0;P17_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT0;ADCCON1|=SET_BIT0;}while(0)							//P17
#define Enable_ADC_AIN1						do{ADCCON0&=0xF0;ADCCON0|=0x01;P30_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT1;ADCCON1|=SET_BIT0;}while(0)		//P30
#define Enable_ADC_AIN2						do{ADCCON0&=0xF0;ADCCON0|=0x02;P07_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT2;ADCCON1|=SET_BIT0;}while(0)		//P07
#define Enable_ADC_AIN3						do{ADCCON0&=0xF0;ADCCON0|=0x03;P06_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT3;ADCCON1|=SET_BIT0;}while(0)		//P06
#define Enable_ADC_AIN4						do{ADCCON0&=0xF0;ADCCON0|=0x04;P05_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT4;ADCCON1|=SET_BIT0;}while(0)		//P05
#define Enable_ADC_AIN5						do{ADCCON0&=0xF0;ADCCON0|=0x05;P04_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT5;ADCCON1|=SET_BIT0;}while(0)		//P04
#define Enable_ADC_AIN6						do{ADCCON0&=0xF0;ADCCON0|=0x06;P03_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT6;ADCCON1|=SET_BIT0;}while(0)		//P03
#define Enable_ADC_AIN7						do{ADCCON0&=0xF0;ADCCON0|=0x07;P11_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT7;ADCCON1|=SET_BIT0;}while(0)		//P11
#define Enable_ADC_BandGap					do{ADCCON0|=SET_BIT3;ADCCON0&=0xF8;ADCCON1|=SET_BIT0																							//Band-gap 1.22V
#define Disable_ADC							ADCCON1&=0xFE;

#define PWM0_FALLINGEDGE_TRIG_ADC			do{ADCCON0&=~SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM2_FALLINGEDGE_TRIG_ADC			do{ADCCON0&=~SET_BIT5;ADCCON0|=SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM4_FALLINGEDGE_TRIG_ADC			do{ADCCON0|=SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM0_RISINGEDGE_TRIG_ADC			do{ADCCON0&=~SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM2_RISINGEDGE_TRIG_ADC			do{ADCCON0&=~SET_BIT5;ADCCON0|=SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM4_RISINGEDGE_TRIG_ADC			do{ADCCON0|=SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM0_CENTRAL_TRIG_ADC				do{ADCCON0&=~SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1|=SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM2_CENTRAL_TRIG_ADC				do{ADCCON0&=~SET_BIT5;ADCCON0|=SET_BIT4;ADCCON1|=SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM4_CENTRAL_TRIG_ADC				do{ADCCON0|=SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1|=SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM0_END_TRIG_ADC					do{ADCCON0&=~SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1|=SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM2_END_TRIG_ADC					do{ADCCON0&=~SET_BIT5;ADCCON0|=SET_BIT4;ADCCON1|=SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;}while(0)
#define PWM4_END_TRIG_ADC					do{ADCCON0|=SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1|=SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;}while(0)

#define P04_FALLINGEDGE_TRIG_ADC			do{ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=SET_BIT1;ADCCON1&=~SET_BIT6;}while(0)
#define P13_FALLINGEDGE_TRIG_ADC			do{ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=SET_BIT1;ADCCON1|=SET_BIT6;}while(0)
#define P04_RISINGEDGE_TRIG_ADC				do{ADCCON0|=0x30;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;ADCCON1&=~SET_BIT6;}while(0)
#define P13_RISINGEDGE_TRIG_ADC				do{ADCCON0|=0x30;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;ADCCON1|=SET_BIT6;}while(0)

// For SPI INIT setting 
#define SPICLK_DIV2							do{clr_SPR0;clr_SPR1;}while(0)
#define SPICLK_DIV4							do{set_SPR0;clr_SPR1;}while(0)
#define SPICLK_DIV8							do{clr_SPR0;set_SPR1;}while(0)
#define SPICLK_DIV16						do{set_SPR0;set_SPR1;}while(0)
#define Enable_SPI_Interrupt				do{set_ESPI;set_EA;}while(0)
#define SS									P15

#define Disable_POR							do{TA=0xAA;TA=0x55;PORDIS=0x5A;TA=0xAA;TA=0x55;PORDIS=0xA5;}while(0)

#endif
